<?php

class FlowersService
{

    public function save($xml)
    {
        // логирование о начале парсинга
        // вызов парсера
        // логирование о завершении и начале сохранения цветов в таблицу flowers
        // вызов сохранения цветов
        // логирование о завершении и начале сохранения картинок цветов
        // вызов сохранения картинок
        // логирование о завершении загрузки локальных картинок
        // отправляем нотификацию о загрузки цветов
        // после завершения загрузки внешних картинок кроном отправляем нотификацию о полном завершении загрузки данных
    }
}